export default () => (
    <svg width="32px" height="32px" viewBox="0 0 32 32" version="1.1" xmlns="http://www.w3.org/2000/svg">
        <title>切片</title>
        <g id="数据集管理-设计稿-0818" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
            <g id="(二级页面)创建数据集" transform="translate(-811.000000, -537.000000)">
                <g id="编组-14" transform="translate(795.000000, 501.000000)">
                    <g id="icon-装饰-已标数据集" transform="translate(16.000000, 36.000000)">
                        <rect id="矩形" x="0" y="0" width="32" height="32" />
                        <g id="编组-2" transform="translate(3.555556, 5.333333)">
                            <g id="编组">
                                <rect
                                    id="矩形备份"
                                    fill="#D8E4FF"
                                    x="3.67676768"
                                    y="0"
                                    width="17.5353535"
                                    height="11.8095238"
                                    rx="3.55555556"
                                />
                                <rect
                                    id="矩形备份"
                                    fill="#A9C1FC"
                                    x="1.6969697"
                                    y="2.28571429"
                                    width="21.4949495"
                                    height="14.4761905"
                                    rx="3.55555556"
                                />
                                <rect
                                    id="矩形"
                                    fill="#3570FF"
                                    x="0"
                                    y="4.57142857"
                                    width="24.8888889"
                                    height="16.7619048"
                                    rx="3.55555556"
                                />
                                <path
                                    d="M13.5834275,11.2460583 L13.5834275,4.57142857 L13.5834275,4.57142857 L21.9359699,4.57142857 L21.9359699,11.2460583 C21.9359699,11.7369781 21.5380008,12.1349472 21.047081,12.1349472 C20.8648407,12.1349472 20.6870042,12.0789327 20.5376607,11.9744912 L17.7596987,10.0317587 L17.7596987,10.0317587 L14.9817367,11.9744912 C14.5794343,12.2558362 14.0252286,12.157781 13.7438835,11.7554786 C13.639442,11.6061351 13.5834275,11.4282986 13.5834275,11.2460583 Z"
                                    id="路径"
                                    fill="#FFCB00"
                                />
                            </g>
                            <rect
                                id="矩形"
                                fill="#FFFFFF"
                                x="3.11111111"
                                y="12.5714286"
                                width="1.94444444"
                                height="1.14285714"
                                rx="0.571428571"
                            />
                            <rect
                                id="矩形备份-4"
                                fill="#FFFFFF"
                                x="6.22222222"
                                y="12.5714286"
                                width="3.88888889"
                                height="1.14285714"
                                rx="0.571428571"
                            />
                            <rect
                                id="矩形备份-3"
                                fill="#FFFFFF"
                                x="3.11111111"
                                y="16"
                                width="11.6666667"
                                height="1.14285714"
                                rx="0.571428571"
                            />
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
);
