export default () => (
    <svg
        width="24px"
        height="24px"
        viewBox="0 0 24 24"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        xmlnsXlink="http://www.w3.org/1999/xlink">
        <title></title>
        <g id="V1.24.4沙盒优化-1222" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
            <g id="浏览器不兼容温馨提示" transform="translate(-732.000000, -254.000000)">
                <g id="编组备份" transform="translate(710.000000, 234.000000)">
                    <g id="icon-状态-常规提示备份-5" transform="translate(22.000000, 20.000000)">
                        <rect id="矩形备份-12" x="0" y="0" width="24" height="24" />
                        <g id="icon-状态-提示" transform="translate(3.600000, 3.600000)">
                            <circle id="椭圆形" fill="#FEAE2E" cx="8.4" cy="8.4" r="8.4" />
                            <path
                                d="M8.4,10.8328767 C9.0627417,10.8328767 9.6,11.3627753 9.6,12.0164384 C9.6,12.6701014 9.0627417,13.2 8.4,13.2 C7.7372583,13.2 7.2,12.6701014 7.2,12.0164384 C7.2,11.3627753 7.7372583,10.8328767 8.4,10.8328767 Z M8.4,3.55616438 C9.00697283,3.55616438 9.50723039,4.05029583 9.57559896,4.68688934 L9.58356164,4.83616438 L9.58356164,8.67616438 C9.58356164,9.38308886 9.05366305,9.95616438 8.4,9.95616438 C7.79302717,9.95616438 7.29276961,9.46203294 7.22440104,8.82543942 L7.21643836,8.67616438 L7.21643836,4.83616438 C7.21643836,4.1292399 7.74633695,3.55616438 8.4,3.55616438 Z"
                                id="形状结合"
                                fill="#FFFFFF"
                                fillRule="nonzero"
                            />
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
);
