export default ({style = {}}) => (
    <svg width="16px" height="16px" style={style} viewBox="0 0 20 20" version="1.1">
        <g id="V3.35-洞察横纵对比分析-选定方案" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
            <g id="05-02新增多客群对比洞察V2-3" transform="translate(-553.000000, -116.000000)">
                <g id="提示" transform="translate(545.000000, 114.000000)">
                    <g id="状态图标/20/常规提示" transform="translate(8.000000, 2.000000)">
                        <rect id="矩形备份-12" x="0" y="0" width="20" height="20" />
                        <g id="icon-状态-提示" transform="translate(3.000000, 3.000000)">
                            <circle id="椭圆形" fill="#FEAE2E" cx="7" cy="7" r="7" />
                            <path
                                d="M6.01369863,4.03013699 C6.01369863,3.44103325 6.45528079,2.96347032 7,2.96347032 C7.50581069,2.96347032 7.92269199,3.37524652 7.9796658,3.90574112 L7.98630137,4.03013699 L7.98630137,7.23013699 C7.98630137,7.81924072 7.54471921,8.29680365 7,8.29680365 C6.49418931,8.29680365 6.07730801,7.88502745 6.0203342,7.35453285 L6.01369863,7.23013699 L6.01369863,4.03013699 Z M7,11 C7.55228475,11 8,10.5584178 8,10.0136986 C8,9.46897942 7.55228475,9.02739726 7,9.02739726 C6.44771525,9.02739726 6,9.46897942 6,10.0136986 C6,10.5584178 6.44771525,11 7,11 Z"
                                id="形状结合"
                                fill="#FFFFFF"
                                fillRule="nonzero"
                            />
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
);
