export default () => (
    <svg width="20px" height="20px" viewBox="0 0 20 20" version="1.1" xmlns="http://www.w3.org/2000/svg">
        <g id="工作台/管理中心/消息中心-0712设计稿" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
            <g id="工作台模块切图说明" transform="translate(-698.000000, -557.000000)">
                <g id="icon-装饰-帮助文档" transform="translate(698.000000, 557.000000)">
                    <g id="编组-16备份-2" transform="translate(2.000000, 2.000000)">
                        <rect id="矩形备份-2" x="0" y="0" width="16" height="16" />
                        <g id="编组" transform="translate(2.000000, 2.000000)" fill="#3570FF" fillRule="nonzero">
                            <path
                                d="M1.51720686,0 C0.682706678,0 0,0.540036001 0,1.200192 L0,10.799856 C0,11.459964 0.682706678,12 1.51720686,12 L12,12 L12,0 L1.51720686,0 Z M3.26618474,0.616751995 L5.79488306,0.616751995 L5.79488306,5.18398799 L4.5305339,4.48389599 L3.26618474,5.18398799 L3.26618474,0.616751995 L3.26618474,0.616751995 Z M10.9480191,11.35146 L2.02293741,11.35146 C1.39704332,11.35146 0.8850171,10.946376 0.8850171,10.451364 C0.8850171,9.956244 1.39704332,9.55121999 2.02293741,9.55121999 L10.9480191,9.55121999 L10.9480191,11.35146 Z"
                                id="形状"
                            />
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
);
